tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
/******************************************************************************/
/* ͷ�ļ����� */
#include "app_cfg.h"
// CH58x_clk.h
#include "CONFIG.h"
#include "HAL.h"
#include "GATTprofile.h"
#include "Peripheral.h"
#include "OTA.h"
#include "OTAprofile.h"
#include "central.h"
#include "ch583_secure.h"

/* ��¼��ǰ��Image */
#include "commoninfo.h"
#include "flash_api.h"
#include "adc_api.h"
#ifdef ENABLE_SOFTWARE_TO_TDX
#include "tdxinfoservice.h"
#endif

#include "debug/Epd_Driver_Debug.h"

void   	Low_power(void);
void   	Low_power_IDLE(void);
/*********************************************************************
 * GLOBAL TYPEDEFS
 */
__attribute__((aligned(4))) uint32_t MEM_BUF[BLE_MEMHEAP_SIZE / 4];

#if(defined(BLE_MAC)) && (BLE_MAC == TRUE)
const uint8_t MacAddr[6] =    {0x84, 0xC2, 0xE4, 0x03, 0x02, 0x02};
#else
uint8_t Mac[6];
uint8_t Mac_ASCII[12];
#endif

/* ����APP�ж��ļ���Ч�� */
const uint32_t Address = 0xFFFFFFFF;
__attribute__((aligned(4))) uint32_t Image_Flag __attribute__((section(".ImageFlag"))) = (uint32_t)&Address;

struct _BOE_DEVICE_STATUS global_DEVICE_STATUS;
struct _BOE_EXTERN_FLASH_INFO global_EXTERN_FLASH_INFO;
uint32_t global_refresh_timer_interval = 0;
uint16_t global_refresh_timer_remaining_hours = 0; // 定时刷屏的时间间�?系统tick�?tick=625us)
uint8_t global_screen_cleared_flag = SCREEN_ALREADY_CLEARED;

#define ADC_CHECK_POLL_TICKS              ((uint32_t)2 * 1600)
#define ADC_CHECK_CHARGING_TICKS          ADC_CHECK_POLL_TICKS
#define ADC_CHECK_IDLE_TICKS              ((uint32_t)12 * 60 * 60 * 1600)
#define ADC_IDLE_CONFIRM_REQUIRED         2
#define ADC_CHECK_IDLE_CONFIRM_TICKS     ((uint32_t)2 * 1600)
#define REFRESH_TIMER_TICKS_PER_HOUR      ((uint32_t)3600 * 1600)
#define REFRESH_TIMER_MAX_SEGMENT_HOURS   23  // 清屏标志：默认已清屏（复位后�?
/* ע�⣺���ڳ���������flash�Ĳ���������ִ�У��������κ��жϣ���ֹ�����жϺ�ʧ�� */
/*********************************************************************
 * @fn      ReadImageFlag
 *
 * @brief   ��ȡ��ǰ�ĳ����Image��־��DataFlash���Ϊ�գ���Ĭ����ImageA
 *
 * @return  none
 */
void ReadImageFlag(void)
{
    unsigned char CurrImageFlag = 0xff;    
    
    OTADataFlashInfo_t p_image_flash;

    EEPROM_READ(OTA_DATAFLASH_ADD, &p_image_flash, 4);
    CurrImageFlag = p_image_flash.ImageFlag;

    Print_I3("ImageFlag=%x  Revd=%x %x %x\n", p_image_flash.ImageFlag, p_image_flash.Revd[0], p_image_flash.Revd[1], p_image_flash.Revd[2]);


    /* �����һ��ִ�У�����û�и��¹����Ժ���º��ڲ���DataFlash */
    if((CurrImageFlag != IMAGE_A_FLAG) && (CurrImageFlag != IMAGE_B_FLAG))
    {
        CurrImageFlag = IMAGE_A_FLAG;
    }
}

/*********************************************************************
 * @fn      Main_Circulation
 *
 * @brief   ��ѭ��
 *
 * @return  none
 */
__HIGH_CODE
void Main_Circulation()
{
    while(1)
    {
        WWDG_SetCounter(0);//ι�� , ����������� û��Ч��
        TMOS_SystemProcess();
    }
}

//������������������������������������������������������������������������������������������������������
//PA00  #define  LED3                GPIO_Pin_0       //:PA  0=on , 1=off
//PA01  
//PA02  
//PA03  
//PA04  #define  epaper_RES   GPIO_Pin_4
//PA05  #define  epaper_DC    GPIO_Pin_5
//PA06  #define  LCD_Power_A  GPIO_Pin_6       //:PA6  0=on , 1=off
//PA07  
//������������������������������������������������������������������������������������������������������

//PA08  #define  ADC_Power              GPIO_Pin_8  // PA 8 ADC  is GPIO_ModeIN_Floating
//PA09  #define  epaper2_RES   GPIO_Pin_9   
//PA10  
//PA11  
//PA12  #define epaper_CS    GPIO_Pin_12
//PA13  #define epaper_SCK   GPIO_Pin_13
//PA14  #define epaper_BUSY  GPIO_Pin_14
//PA15  #define epaper_SDI   GPIO_Pin_15
//������������������������������������������������������������������������������������������������������
//������������������������������������������������������������������������������������������������������
// Sleep
//GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15,GPIO_ModeIN_Floating);
//GPIOA_ModeCfg(GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_10|GPIO_Pin_11, GPIO_ModeIN_PU);

// Working
//    GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_9|GPIO_Pin_12|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_14,GPIO_ModeOut_PP_5mA);
//    GPIOA_ModeCfg(GPIO_Pin_8,GPIO_ModeIN_Floating);
//#ifdef ENABLE_SCREEN_COLOR_6
//    GPIOA_ModeCfg(GPIO_Pin_3|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_14, GPIO_ModeIN_PU);
//#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
//    GPIOA_ModeCfg(GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_5|GPIO_Pin_11|GPIO_Pin_12, GPIO_ModeOut_PP_5mA); // M009FT CS/DC/RESET stay as outputs
//    GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_9, GPIO_ModeIN_PU); // Dual busy inputs
//#endif
//#else
//    GPIOA_ModeCfg(GPIO_Pin_3|GPIO_Pin_7|GPIO_Pin_14, GPIO_ModeIN_PU);
//#endif

    
// Working
//GPIOB_ModeCfg(GPIO_Pin_14 |GPIO_Pin_15,GPIO_ModeOut_PP_5mA);
//GPIOB_ModeCfg(GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_13, GPIO_ModeIN_PU);
//   GPIO_ModeIN_Floating, //��������
//   GPIO_ModeIN_PU,       //��������
//...GPIO_ModeIN_PD,       //��������
//  .GPIO_ModeOut_PP_5mA,  //����������5mA
//...GPIO_ModeOut_PP_20mA, //����������20mA

//������������������������������������������������������������������������������������������������������
//PA00  NULL   GPIO_ModeIN_Floating, //��������
//PA01  NULL   GPIO_ModeIN_Floating, //��������
//PA02  NULL   GPIO_ModeIN_Floating, //��������
//PA03  NULL   GPIO_ModeIN_Floating, //��������
//PA04  #define  epaper_RES   GPIO_Pin_4     GPIO_ModeIN_PU,       //��������
//PA05  #define  epaper_DC    GPIO_Pin_5     GPIO_ModeIN_PU,       //��������
//PA06  #define  LCD_Power_A  GPIO_Pin_6      
        //:PA6  0=on , 1=off   
        //GPIO_ModeOut_PP_5mA,  //����������5mA
//PA07  NULL   GPIO_ModeIN_Floating, //��������
//������������������������������������������������������������������������������������������������������

//PA08  NULL   GPIO_ModeIN_Floating, //��������
//PA09  #define  epaper2_RES   GPIO_Pin_9       GPIO_ModeIN_PU,       //�������� 
//PA10  NULL   GPIO_ModeIN_Floating, //��������
//PA11  NULL   GPIO_ModeIN_Floating, //��������
//PA12  #define epaper_CS    GPIO_Pin_12     GPIO_ModeIN_PU,       //��������
//PA13  #define epaper_SCK   GPIO_Pin_13     GPIO_ModeIN_PU,       //��������
//PA14  #define epaper_BUSY  GPIO_Pin_14     GPIO_ModeIN_PU,       //��������
//PA15  #define epaper_SDI   GPIO_Pin_15     GPIO_ModeIN_PU,       //��������
//������������������������������������������������������������������������������������������������������

//GPIOA_ModeCfg(GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_10|GPIO_Pin_11,GPIO_ModeIN_Floating);
//GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_9|GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15|, GPIO_ModeIN_PU);
//GPIOA_ModeCfg(GPIO_Pin_6, GPIO_ModeOut_PP_5mA);
//������������������������������������������������������������������������������������������������������
//PB00  NULL  GPIO_ModeIN_Floating, //��������
//PB01  NULL  GPIO_ModeIN_Floating, //��������
//PB02  NULL  GPIO_ModeIN_Floating, //��������
//PB03  NULL  GPIO_ModeIN_Floating, //��������
//PB04  NULL  GPIO_ModeIN_Floating, //��������
//PB05  NULL  GPIO_ModeIN_Floating, //��������
//PB06  NULL  GPIO_ModeIN_Floating, //��������
//PB07  NULL  GPIO_ModeIN_Floating, //��������
//������������������������������������������������������������������������������������������������������

//PB08  NULL  GPIO_ModeIN_Floating, //��������
//PB09  #define  LCD_Power_B       GPIO_Pin_9    
       //:PB9  0=on , 1=off //:PA6  0=on , 1=off
       //GPIO_ModeOut_PP_5mA,  //����������5mA
//PB10  NULL  GPIO_ModeIN_Floating, //��������  
//PB11  NULL  GPIO_ModeIN_Floating, //��������  
//PB12  #define epaper2_BUSY  GPIO_Pin_12   GPIO_ModeIN_PU,       //�������� 
//PB13  NULL  GPIO_ModeIN_Floating, //��������
//PB14  #define epaper2_CS    GPIO_Pin_14  GPIO_ModeIN_PU,       //�������� 
//PB15  #define epaper2_DC    GPIO_Pin_15  GPIO_ModeIN_PU,       //�������� 
//������������������������������������������������������������������������������������������������������

//#define  Key1_def  GPIO_Pin_8    // PB
//#define  Key2_def  GPIO_Pin_3    // PB
//#define  Key3_def  GPIO_Pin_0    // PB
//#define  Key5_def  GPIO_Pin_4    // PB
//#define  CHARGE_LED  GPIO_Pin_13   // PB  �����?//#define  LED3                GPIO_Pin_0       //:PA  0=on , 1=off
//#define  LED1                GPIO_Pin_1       //:PB  0=on , 1=off
//#define  LED2                GPIO_Pin_2       //:PB  0=on , 1=off
//#define  LED5_Power          GPIO_Pin_5       //:PB  0=on , 1=off
//#define  LED6_Power          GPIO_Pin_6       //:PB  0=on , 1=off
//#define  LED5                GPIO_Pin_21      //:PB  0=on , 1=off

