tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
void  low_power_IIO_New(void)
{
	ControlEPDPower(Is_Off);
	mDelaymS(500);

	GPIOA_ModeCfg(GPIO_Pin_All, GPIO_ModeIN_Floating);
	GPIOB_ModeCfg(GPIO_Pin_All, GPIO_ModeIN_Floating);

#ifdef ENABLE_SCREEN_COLOR_6
    /*
     * 6-color hardware:
     * CLK-1/CLK-2: PA13, DATA-1/DATA-2: PA15, CS-1: PA12, CD-1: PA5,
     * BUSY-1: PA4, RST-1: PA3, CS-2: PB14, CD-2: PB15, BUSY-2: PA9, RST-2: PA11,
     * LED1/LED2: PB5/PB6, POWER-1/POWER-2: PA6, ADC: PA7, CHARGE: PB13,
     * FLASH-DATA/FLASH-CLK/FLASH-CS: PA2/PA0/PB12.
     */

    // LED1/LED2 off. PB7 keeps the original 6-color low-power state.
    GPIOB_SetBits(GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7);
    GPIOB_ModeCfg(GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7, GPIO_ModeOut_PP_5mA);

    // CS-1, CS-2 and FLASH-CS low.
    GPIOA_ResetBits(GPIO_Pin_12);
    GPIOA_ModeCfg(GPIO_Pin_12, GPIO_ModeOut_PP_5mA);
    GPIOB_ResetBits(GPIO_Pin_12 | GPIO_Pin_14);
    GPIOB_ModeCfg(GPIO_Pin_12 | GPIO_Pin_14, GPIO_ModeOut_PP_5mA);

    // BUSY-1/BUSY-2 pull-down inputs.
    GPIOA_ModeCfg(GPIO_Pin_4 | GPIO_Pin_9, GPIO_ModeIN_PD);

    // CHARGE detect pull-down input.
    GPIOB_ModeCfg(GPIO_Pin_13, GPIO_ModeIN_PD);

    // FLASH-CLK, RST-1, CD-1, RST-2 and CLK low.
    GPIOA_ResetBits(GPIO_Pin_0 | GPIO_Pin_3 | GPIO_Pin_5 | GPIO_Pin_11 | GPIO_Pin_13);
    GPIOA_ModeCfg(GPIO_Pin_0 | GPIO_Pin_3 | GPIO_Pin_5 | GPIO_Pin_11 | GPIO_Pin_13, GPIO_ModeOut_PP_5mA);

    // FLASH-DATA, DATA and CD-2 stay floating.
    GPIOA_ModeCfg(GPIO_Pin_2 | GPIO_Pin_15, GPIO_ModeIN_Floating);
    GPIOB_ModeCfg(GPIO_Pin_15, GPIO_ModeIN_Floating);

    // ADC pull-up input.
    GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);

#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
    // M009FT extra slave CS pins.
    GPIOA_ResetBits(GPIO_Pin_1);
    GPIOA_ModeCfg(GPIO_Pin_1, GPIO_ModeOut_PP_5mA);
    GPIOB_ResetBits(GPIO_Pin_9);
    GPIOB_ModeCfg(GPIO_Pin_9, GPIO_ModeOut_PP_5mA);
#endif
#else
    /*
     * Non-6-color hardware:
     * CLK-1/CLK-2: PA13, DATA-1/DATA-2: PA15, CS-1: PA12, CD-1: PA5,
     * BUSY-1: PA14, RST-1: PA4, CS-2: PB14, CD-2: PB15, BUSY-2: PB16, RST-2: PA9,
     * LED1/LED2: PB5/PB6, POWER-1/POWER-2: PA6, ADC: PA7, CHARGE: PB13,
     * FLASH-DATA/FLASH-CLK/FLASH-CS: PA2/PA0/PB12.
     */

    // LED1/LED2 off. PB7 keeps the original low-power state.
    GPIOB_SetBits(GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7);
    GPIOB_ModeCfg(GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7, GPIO_ModeOut_PP_5mA);

    // CS-1, CS-2 and FLASH-CS low.
    GPIOA_ResetBits(GPIO_Pin_12);
    GPIOA_ModeCfg(GPIO_Pin_12, GPIO_ModeOut_PP_5mA);
    GPIOB_ResetBits(GPIO_Pin_12 | GPIO_Pin_14);
    GPIOB_ModeCfg(GPIO_Pin_12 | GPIO_Pin_14, GPIO_ModeOut_PP_5mA);

    // BUSY-1/BUSY-2 pull-down inputs.
    GPIOA_ModeCfg(GPIO_Pin_14, GPIO_ModeIN_PD);
    GPIOB_ModeCfg(GPIO_Pin_16, GPIO_ModeIN_PD);

    // CHARGE detect pull-down input.
    GPIOB_ModeCfg(GPIO_Pin_13, GPIO_ModeIN_PD);

    // FLASH-CLK, RST-1, CD-1, RST-2 and CLK low.
    GPIOA_ResetBits(GPIO_Pin_0 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_9 | GPIO_Pin_13);
    GPIOA_ModeCfg(GPIO_Pin_0 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_9 | GPIO_Pin_13, GPIO_ModeOut_PP_5mA);

    // FLASH-DATA, DATA and CD-2 stay floating.
    GPIOA_ModeCfg(GPIO_Pin_2 | GPIO_Pin_15, GPIO_ModeIN_Floating);
    GPIOB_ModeCfg(GPIO_Pin_15, GPIO_ModeIN_Floating);

    // ADC pull-up input.
    GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
#endif

}

tmosTaskID main_task_ID;

void  Disable_GPIO_IRQ(void)
{
    PFIC_DisableIRQ(GPIO_B_IRQn);
}

void Init_GPIO(void)
{
	Print_I3("===================");
	// Working
    GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_9|GPIO_Pin_12|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_14,GPIO_ModeOut_PP_5mA);
    GPIOA_ModeCfg(GPIO_Pin_8,GPIO_ModeIN_Floating);
#ifdef ENABLE_SCREEN_COLOR_6
    GPIOA_ModeCfg(GPIO_Pin_3|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_14, GPIO_ModeIN_PU);
#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
    GPIOA_ModeCfg(GPIO_Pin_1|GPIO_Pin_3|GPIO_Pin_5|GPIO_Pin_11|GPIO_Pin_12, GPIO_ModeOut_PP_5mA); // M009FT CS/DC/RESET stay as outputs
    GPIOA_ModeCfg(GPIO_Pin_4|GPIO_Pin_9, GPIO_ModeIN_PU); // Dual busy inputs
#endif
#else
    GPIOA_ModeCfg(GPIO_Pin_3|GPIO_Pin_7|GPIO_Pin_14, GPIO_ModeIN_PU);
#endif

	// Working
	GPIOB_ModeCfg(GPIO_Pin_14 |GPIO_Pin_15|GPIO_Pin_16,GPIO_ModeOut_PP_5mA);
#ifdef ENABLE_INK_SCREEN_UC8579_1360X480_COLOR_4
	GPIOB_ModeCfg(GPIO_Pin_16, GPIO_ModeIN_PU); // UC8579 B-side BUSY
#endif
#ifdef  Debug_mode_on
	GPIOB_ModeCfg(GPIO_Pin_7, GPIO_ModeOut_PP_5mA);
#ifdef ENABLE_SCREEN_COLOR_6
	GPIOB_ModeCfg(GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_21|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_22, GPIO_ModeIN_PU);
#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
	GPIOB_ModeCfg(GPIO_Pin_9, GPIO_ModeOut_PP_5mA); // B side slave CS
#endif
#else
	GPIOB_ModeCfg(GPIO_Pin_21|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_8|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_22, GPIO_ModeIN_PU);
#endif
#else
#ifdef ENABLE_SCREEN_COLOR_6
	GPIOB_ModeCfg(GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_21|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_22, GPIO_ModeIN_PU);
#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
	GPIOB_ModeCfg(GPIO_Pin_9, GPIO_ModeOut_PP_5mA); // B side slave CS
#endif
#else
	GPIOB_ModeCfg(GPIO_Pin_21|GPIO_Pin_2|GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_22, GPIO_ModeIN_PU);
#endif
#endif
	GPIOB_ModeCfg(GPIO_Pin_13, GPIO_ModeIN_PD);

#ifdef ENABLE_INK_SCREEN_M009FT_1024X600_COLOR_6
	R32_PA_OUT |= (epaper_NEW_RES | epaper2_NEW_RES | epaper_CS | epaper_CS_SLAVE);
	R32_PB_OUT |= (epaper2_CS | epaper2_CS_SLAVE);
#elif defined(ENABLE_INK_SCREEN_UC8579_1360X480_COLOR_4)
	R32_PA_OUT |= (epaper_CS | epaper_CS_SLAVE | epaper2_CS_SLAVE);
	R32_PB_OUT |= epaper2_CS;
#else
	R32_PA_OUT |= (epaper_CS);//R32_PA_OUT |= (epaper_CS | epaper_CS_SLAVE);
	R32_PB_OUT |= (epaper2_CS);//R32_PB_OUT |= (epaper2_CS | epaper2_CS_SLAVE);
#endif
}

/******************************** endfile @ main ******************************/
// Rec_OTA_IAP_DataDeal
// OTA_IAPWriteData
void  Get_time(void)
{
    uint8 Len;
    uint8 Buf[200];    
    uint16_t  py, pmon, pd, ph, pm, ps;
    
    RTC_GetTime(&py,&pmon,&pd,&ph,&pm,&ps);
    Print_I3("��=%d  ��=%d  ��=%d  Сʱ=%d   ����=%d   ��=%d",py, pmon, pd, ph, pm, ps);
    Len = strlen(Buf);
    if(Len >20)
        Len=20;
}


UINT8  Ble_Scan=Is_Off;
UINT8  Ble_Central_Scan= Is_Off;
static uint8_t adc_idle_confirm_count = 0;
static uint16_t adc_idle_monitor_count = 0;


