tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
static void StartChargeMonitor(void)
{
    adc_idle_confirm_count = 0;
    adc_idle_monitor_count = 0;
    tmos_start_task(main_task_ID, EVENY_Is_Charge, ADC_CHECK_POLL_TICKS);
}

static void ScheduleNextRefreshTimerSegment(void)
{
	uint16_t segment_hours;

	if(global_refresh_timer_remaining_hours == 0){
		return;
	}

	segment_hours = global_refresh_timer_remaining_hours;
	if(segment_hours > REFRESH_TIMER_MAX_SEGMENT_HOURS){
		segment_hours = REFRESH_TIMER_MAX_SEGMENT_HOURS;
	}

	tmos_start_task(main_task_ID,
					EVENT_Refresh_Timer,
					(uint32_t)segment_hours * REFRESH_TIMER_TICKS_PER_HOUR);
}

static void StartRefreshTimerCycle(void)
{
	global_refresh_timer_interval = (uint32_t)REFRESH_TIMER_FIXED_HOURS * REFRESH_TIMER_TICKS_PER_HOUR;
	global_refresh_timer_remaining_hours = REFRESH_TIMER_FIXED_HOURS;
	ScheduleNextRefreshTimerSegment();
}

static uint8_t RefreshTimerSegmentElapsed(void)
{
	uint16_t segment_hours;

	if(global_refresh_timer_remaining_hours == 0){
		return Is_Yes;
	}

	segment_hours = global_refresh_timer_remaining_hours;
	if(segment_hours > REFRESH_TIMER_MAX_SEGMENT_HOURS){
		segment_hours = REFRESH_TIMER_MAX_SEGMENT_HOURS;
	}

	global_refresh_timer_remaining_hours -= segment_hours;
	if(global_refresh_timer_remaining_hours > 0){
		ScheduleNextRefreshTimerSegment();
		return Is_No;
	}

	return Is_Yes;
}

//UINT8  Frist_time=0;
void Save_LastRefresh_Info_To_Flash(void)
{
	// ============ 统一在这里保存刷屏信息到flash（用于定时刷屏恢复） ============
	// 在进入低功耗前，判断刚才是什么类型的刷屏，并保存索引、group、room等信�?	// 注意：只保存一次，使用静态变量避免重复保�?	// fDataSendSuccess保持Is_Yes状态，确保Low_power_IDLE()循环期间不会被peripheral.c:713-716打断
	static uint8_t last_saved_success_flag = Is_No;
	if(global_DEVICE_STATUS.fDataSendSuccess == Is_Yes && last_saved_success_flag == Is_No){
		// 刷屏成功且未保存过，保存信息
		// 判断屏幕模式（根据fScreenType和fImageIndex�?		// 注意：普通刷图时，fImageIndex就是0�?（无偏移），预存刷图不依赖此判断
		uint8_t base_index = global_EXTERN_FLASH_INFO.fImageIndex;
		
		uint8_t screen_mode;
		if(base_index == SCREEN_A_COMMON_INDEX){
			// 基础index=0 表示异显模式
			screen_mode = SCREEN_MODE_AB_DIFF;
		} else {
			// 基础index=1，根�?fScreenType 判断
			if(global_DEVICE_STATUS.fScreenType == SCREEN_TYPE_IMG_A){
				screen_mode = SCREEN_MODE_SINGLE_A;
			} else if(global_DEVICE_STATUS.fScreenType == SCREEN_TYPE_IMG_B){
				screen_mode = SCREEN_MODE_SINGLE_B;
			} else {
				screen_mode = SCREEN_MODE_AB_SAME;
			}
		}
		
		if(global_DEVICE_STATUS.fRefreshType == DEVICE_OP_COMMON){
			// 纯实时刷屏（不带预存�?			// 刷图不允许改 enabled（只由TIME命令改），这里保持原�?			// 正常刷图后，设置清屏标志为未清屏，下次开机能正常进入定时刷图
			global_screen_cleared_flag = SCREEN_NOT_CLEARED;
			saveLastRefreshInfo(LAST_REFRESH_TYPE_COMMON, 0, 0, screen_mode, global_EXTERN_FLASH_INFO.fZip, 
							   SAVE_KEEP_U8, global_screen_cleared_flag);
		}
		else if(global_DEVICE_STATUS.fRefreshType == DEVICE_OP_COMMON_PRESAVE || 
		        global_DEVICE_STATUS.fRefreshType == DEVICE_OP_PRESAVE){
			// 预存刷屏（包括实时传�?预存、或从flash读取预存�?			// 预存刷屏的screen_mode无意义，因为通过group/room定位，固定为AB_SAME
			Print_I3("Save refresh info: PRESAVE mode, group=%d, room=%d, index=%d, zip=%d (keep timer cfg)",
					 global_DEVICE_STATUS.fBoardCastGroup, global_DEVICE_STATUS.fBoardCastRoom,
					 global_EXTERN_FLASH_INFO.fImageIndex, global_EXTERN_FLASH_INFO.fZip);
			// 刷图不允许改 enabled（只由TIME命令改），这里保持原�?			// 预存刷图后，设置清屏标志为未清屏，下次开机能正常进入定时刷图
			global_screen_cleared_flag = SCREEN_NOT_CLEARED;
			saveLastRefreshInfo(LAST_REFRESH_TYPE_PRESAVE,
							   global_DEVICE_STATUS.fBoardCastGroup,
							   global_DEVICE_STATUS.fBoardCastRoom,
							   screen_mode,
							   global_EXTERN_FLASH_INFO.fZip,
							   SAVE_KEEP_U8,
							   global_screen_cleared_flag);
		}
		
		// 标记已保存，避免重复保存，但不重置fDataSendSuccess
        // keep success flag until a new refresh cycle starts
        last_saved_success_flag = Is_Yes;
	}
	// 如果是新的刷屏周期开始（fDataSendSuccess从Is_Yes变为Is_No），重置保存标志
	
	if(global_DEVICE_STATUS.fDataSendSuccess == Is_No){
		last_saved_success_flag = Is_No;
	}
	// ======================================================================

}

tmosEvents Main_Event(tmosTaskID task_id, tmosEvents events)
{
    uint8_t *msgPtr;
    if(events & SYS_EVENT_MSG)
    { // SYS_EVENT_MSG
        msgPtr = tmos_msg_receive(task_id);
        if(msgPtr)
        {
            /* De-allocate */
            tmos_msg_deallocate(msgPtr);
        }
        return events ^ SYS_EVENT_MSG;
    }

    if(events & EVENT_Get_Battle_Charge)
    {	
	if(global_DEVICE_STATUS.fImageType == 1){
		// 异显模式：需要刷两次（A�?B面）
		// 普通刷图的异显模式：不管内外置flash，都直接�?/1（不加偏移）
        // First refresh: A side.
        global_DEVICE_STATUS.fInitDriver = Is_Yes;
		global_DEVICE_STATUS.fImageDataLen = 0;
		global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_A;
		global_EXTERN_FLASH_INFO.fImageIndex = SCREEN_B_COMMON_INDEX; // 1
		
		if(preSaveDisplayColor(0, 0, DEVICE_PRE_SAVE) == -1){
			PRINT("send pre save  error \r\n");	
			global_DEVICE_STATUS.fWorked =Is_No;
		}
		mDelaymS(2000);
		
        // Second refresh: B side.
        global_DEVICE_STATUS.fScreenType = SCREEN_TYPE_IMG_B;
		global_DEVICE_STATUS.fIsNeedStandby = 1;
		global_DEVICE_STATUS.fInitDriver = Is_Yes;
		global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
		global_DEVICE_STATUS.fPackageCnt = 0;
		global_DEVICE_STATUS.fImageDataLen = 0;
		global_EXTERN_FLASH_INFO.fImageIndex = SCREEN_A_COMMON_INDEX; // 0
		
		if(preSaveDisplayColor(0, 0, DEVICE_PRE_SAVE) == -1){
			PRINT("send pre save  error \r\n");	
			global_DEVICE_STATUS.fWorked =Is_No;
		}
		else{
			// AB双屏刷新成功，标记成功（在EVENT_Low_Power统一保存）Save_LastRefresh_Info_To_Flash用到
			global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
		}
	}
	else{
		global_DEVICE_STATUS.fImageType = 0;
		global_DEVICE_STATUS.fIsNeedStandby = 1;
		if(preSaveDisplayColor(global_DEVICE_STATUS.fBoardCastGroup, global_DEVICE_STATUS.fBoardCastRoom, DEVICE_PRE_SAVE) == -1){
			PRINT("send pre save  error \r\n"); 
			global_DEVICE_STATUS.fWorked =Is_No;
		}
		else{
			// 预存刷屏成功，标记成功（在EVENT_Low_Power统一保存）Save_LastRefresh_Info_To_Flash用到
			global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
		}

