tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
	}
      	return events ^ EVENT_Get_Battle_Charge;
    }
	
    if(events & EVENY_Is_Charge)
    {
        uint8_t was_charging = global_DEVICE_STATUS.fIsCharg;
        uint8_t is_charging_now = GetCurrentChargeStatus();
        uint8_t need_adc_check = Is_No;

        if((is_charging_now == Is_Yes) || (was_charging == Is_Yes)){
            adc_idle_confirm_count = 0;
            adc_idle_monitor_count = 0;
            need_adc_check = Is_Yes;
        }else{
            if(adc_idle_confirm_count < ADC_IDLE_CONFIRM_REQUIRED){
                adc_idle_confirm_count++;
                need_adc_check = Is_Yes;
            }else{
                adc_idle_monitor_count++;
                if(adc_idle_monitor_count >= (ADC_CHECK_IDLE_TICKS / ADC_CHECK_POLL_TICKS)){
                    adc_idle_monitor_count = 0;
                    need_adc_check = Is_Yes;
                }
            }
        }

        if(need_adc_check == Is_Yes){
            AdcTask();
        }

        tmos_start_task(main_task_ID, EVENY_Is_Charge, ADC_CHECK_POLL_TICKS);
        return events ^ EVENY_Is_Charge;
    }

    if(events & EVENT_Check_TimeOut)
    {
		if((global_DEVICE_STATUS.fWorked == Is_No) && (global_DEVICE_STATUS.fDataSendSuccess == Is_No)
			&& ((global_DEVICE_STATUS.fRefreshType == DEVICE_OP_COMMON) || (global_DEVICE_STATUS.fRefreshType == DEVICE_OP_COMMON_PRESAVE)))
		{
			if(global_DEVICE_STATUS.fisHaveData == Is_Yes){
				global_DEVICE_STATUS.fisHaveData = Is_No;
				global_DEVICE_STATUS.fSystemTimeOut = 0;
			}else{
				global_DEVICE_STATUS.fSystemTimeOut++;
				Print_I3("ble timeout = %d",global_DEVICE_STATUS.fSystemTimeOut);
				if(global_DEVICE_STATUS.fSystemTimeOut > 30){
					Print_I3("bleconnect timeout");
					global_DEVICE_STATUS.fSystemTimeOut = 0;
					//global_DEVICE_STATUS.fWorked =Is_No;
					tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
				}
			}
    	}else{
			global_DEVICE_STATUS.fSystemTimeOut = 0;
    	}
		tmos_start_task(main_task_ID,EVENT_Check_TimeOut,1600);
	
		return events ^ EVENT_Check_TimeOut;
    }
	
	if(events & EVENT_Low_Power)
	{ 
		Print_I3("..............EVENT_Low_Power 00000000000000000");		
		
		Save_LastRefresh_Info_To_Flash();	
			
		if(global_DEVICE_STATUS.fisOtaed != 1)
			Low_power();
		
		return events ^ EVENT_Low_Power;
	}

	if(events & EVENT_Refresh_Timer)
	{
		if(global_refresh_timer_interval > 0){
			if(RefreshTimerSegmentElapsed() != Is_Yes){
				return events ^ EVENT_Refresh_Timer;
			}

			Print_I3("EVENT_Refresh_Timer triggered, refreshing screen from flash");
			// 从flash读取上次刷屏的类型和参数
			// index/zip/fScreenType 会由 getLastRefreshInfo() 回写到全局变量
			// 小时数使用固定�?REFRESH_TIMER_FIXED_HOURS
			uint8_t last_type, last_group, last_room, last_enabled, last_screen_mode;
			getLastRefreshInfo(&last_type, &last_group, &last_room, &last_enabled, &last_screen_mode);

			uint8_t last_index = global_EXTERN_FLASH_INFO.fImageIndex;
			uint8_t last_zip = global_EXTERN_FLASH_INFO.fZip;

            // Set refresh parameters to match normal image transfer.
            global_DEVICE_STATUS.fPackageCnt = 0;
            global_DEVICE_STATUS.fPackageCount = 0xFFFF;
            global_DEVICE_STATUS.fDataSendSuccess = Is_No;
            global_DEVICE_STATUS.fOtaStatus = RTN_OTA_COMMON;
            global_DEVICE_STATUS.fIsNeedStandby = 1;
            global_DEVICE_STATUS.fInitDriver = Is_Yes;
            global_DEVICE_STATUS.fImageDataLen = 0;
            global_EXTERN_FLASH_INFO.fBlockNum = EXTERN_FLASH_BLOCK_FIRST_ADDR;
            global_EXTERN_FLASH_INFO.fImageIndex = last_index;
            global_EXTERN_FLASH_INFO.fZip = last_zip;

			// 根据flash中保存的类型进行刷屏
			if(last_type == LAST_REFRESH_TYPE_COMMON || last_type == LAST_REFRESH_TYPE_NONE){
                // Common refresh mode.
                global_DEVICE_STATUS.fRefreshType = DEVICE_OP_COMMON;
				
                // Check whether this is AB-diff mode.
                if(last_screen_mode == SCREEN_MODE_AB_DIFF){
					// 异显模式：触�?EVENT_Get_Battle_Charge，让它自动刷两次（A�?B面）
                    // fImageType is already set by getLastRefreshInfo().
                    InitFlashDriver();
					mDelayuS(10);
					
					tmos_start_task(main_task_ID, EVENT_Get_Battle_Charge, 100);
					mDelayuS(10);
					DeInitFlashDriver();
				} else {
                    // Single side or same-display mode: refresh once.
                    InitFlashDriver();
					mDelayuS(10);
					
					if(preSaveDisplayColor(0, 0, DEVICE_PRE_SAVE) == -1){
						PRINT("Refresh timer: pre save display error\r\n");
						global_DEVICE_STATUS.fWorked = Is_No;
					} else {
						global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
					}
					mDelayuS(10);
					DeInitFlashDriver();
				}
			}else if(last_type == LAST_REFRESH_TYPE_PRESAVE){
				// 预存模式：需要根�?group/room 重新计算 index
				global_DEVICE_STATUS.fRefreshType = DEVICE_OP_PRESAVE;
                // Save group/room for low-power refresh info persistence.
                global_DEVICE_STATUS.fBoardCastGroup = last_group;
				global_DEVICE_STATUS.fBoardCastRoom = last_room;
				InitFlashDriver();
				mDelayuS(10);
				
				if(preSaveDisplayColor(global_DEVICE_STATUS.fBoardCastGroup, global_DEVICE_STATUS.fBoardCastRoom, DEVICE_PRE_SAVE) == -1){
					PRINT("Refresh timer: pre save display error\r\n");
					global_DEVICE_STATUS.fWorked = Is_No;
				} else {
                    // Mark success so EVENT_Low_Power can persist refresh info.
                    global_DEVICE_STATUS.fDataSendSuccess = Is_Yes;
				}
				mDelayuS(10);
				DeInitFlashDriver();
			}
			else{
				PRINT("Unknown refresh type: 0x%02X, skip refresh\r\n", last_type);
			}
			
			// 重新启动定时器，实现循环刷屏
			StartRefreshTimerCycle();
		}
		
		return events ^ EVENT_Refresh_Timer;
	}
	
    if(events & EVENT_IDLE)
    {    
   		Low_power_IDLE();
      	return events ^ EVENT_IDLE;
    }  

    if(events & EVENT_Test_Msg)
    { 
		//Print_I3("..............EVENT_Test_Msg 000000000000000000000");   
#ifdef EPD_BWSOLID_IMG_CYCLE_TEST_ENABLE
		EPD_BWSolidImg_CycleTest();
#endif
		tmos_start_task(main_task_ID,EVENT_Test_Msg,1600);
		return events ^ EVENT_Test_Msg;
    }

	if(events & EVENT_Start_Peripheral_Mode)
	{		
		//Print_I3("EVENT_Start_Peripheral_Mode 00 Ble_connect_or_no:%d UC7279_worked:%d Ble_Scan:%d",Ble_connect_or_no,UC7279_worked,Ble_Scan);
		if(Ble_Scan==Is_Off)
		{
			Ble_Scan=Is_On;
			Start_advertising();
			//Print_I3("EVENT_Start_Peripheral_Mode start ......");
			tmos_start_task(main_task_ID,EVENT_Start_Peripheral_Mode ,100);	//	(units of 625us, 80=50ms)
		}
		else
		{
			Ble_Scan=Is_Off;
			//Print_I3("EVENT_Start_Peripheral_Mode stop stop stop stop stop stop");
			Stop_advertising();
			tmos_start_task(main_task_ID,EVENT_Start_Peripheral_Mode ,1000);	// 
		}
		
		return events ^ EVENT_Start_Peripheral_Mode;
	}

    if(events & EVENT_Start_Central_Mode)
    {   
		/*if(global_DEVICE_STATUS.fBle_connect_or_no==Is_OK)
		{
			Ble_Scan=Is_On;
		}

		if(  global_DEVICE_STATUS.fWorked == Is_Yes)
		{
			Ble_Scan=Is_On;
		}*/
      	if(Ble_Central_Scan==Is_Off)
       	{
			Ble_Central_Scan=Is_On;
			Start_Central_Scan();
			//Start_advertising();
			//Print_I3("high Start_Central_Scan start start start start");
			tmos_start_task(main_task_ID,EVENT_Start_Central_Mode ,100);  //  (units of 625us, 80=50ms)
       	}
       	else
       	{
			Ble_Central_Scan=Is_Off;
			Stop_Central_Scan();
			//Stop_advertising();
			//Print_I3("high Start_Central_Scan stop stop stop stop");
			tmos_start_task(main_task_ID,EVENT_Start_Central_Mode ,2*1600);   // 
       	}
      	return events ^ EVENT_Start_Central_Mode;
    }

    if(events & EVENT_Boardcast_Op)
    { 
		processGapBroadcastAdData();
		return events ^ EVENT_Boardcast_Op;
    }

