tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
	return 0;
}    

//  RXD0/TXD0 0=RXD0/TXD0 on PB[4]/PB[7], 1=RXD0_/TXD0_ on PA[15]/PA[14]
//  RXD1/TXD1 0=RXD1/TXD1 on PA[8]/PA[9], 1=RXD1_/TXD1_ on PB[12]/PB[13]
//  RXD2/TXD2 0=RXD2/TXD2 on PA[6]/PA[7], 1=RXD2_/TXD2_ on PB[22]/PB[23]
//  RXD3/TXD3 0=RXD3/TXD3 on PA[4]/PA[5], 1=RXD3_/TXD3_ on PB[20]/PB[21]
//R8_GLOB_RESET_KEEP
//RB_ROM_CODE_OFS
//SYS_GetLastResetSta()
//#define  RB_ROM_CODE_OFS    0x10                      // RWA, code offset address selection in Flash ROM: 0=start address 0x000000, 1=start address 0x008000
// RB_RESET_FLAG: recent reset flag
//   000 - SR, software reset, by RB_SOFTWARE_RESET=1 @RB_WDOG_RST_EN=0
//   001 - RPOR, real power on reset
//   010 - WTR, watch-dog timer-out reset
//   011 - MR, external manual reset by RST pin input low
//   101 - GRWSM, global reset by waking under shutdown mode
//   1?? - LRW, power on reset occurred during sleep

UINT8  GetLastResetSta(void)
{
   UINT32  u32chr; 
   u32chr = SYS_GetLastResetSta();
   //Print_I3(" %x",u32chr);
   return u32chr;
    //   000 - SR, software reset, by RB_SOFTWARE_RESET=1 @RB_WDOG_RST_EN=0
    //   001 - RPOR, real power on reset
    //   010 - WTR, watch-dog timer-out reset
    //   011 - MR, external manual reset by RST pin input low
    //   101 - GRWSM, global reset by waking under shutdown mode
    //   1?? - LRW, power on reset occurred during sleep  
}

//  Sleep_Time==7  then 8 second
//  Sleep_Time==8  then 16 second
//  Sleep_Time==9  then 32 second

//RTC_TMRFunCfg(Period_2_S);
//RTC_TRIGFunCfg(32768*2);    //32768Ϊ1s
UINT8   Low_Power_RTC(UINT8  Sleep_Time)
{
	//      LClk32K_Select(Clk32K_LSE);//�����ⲿ32K
	//      R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG1;
	//      R8_SAFE_ACCESS_SIG = SAFE_ACCESS_SIG2;
	//      R8_CK32K_CONFIG |= RB_CLK_XT32K_PON;
	//      R8_SAFE_ACCESS_SIG = 0;
	uint32_t irq_status;      
	SYS_DisableAllIrq(&irq_status);
	// WWDG_ResetCfg(DISABLE);
	PFIC_DisableIRQ(RTC_IRQn);
	// LClk32K_Select(0);
	// HAL_SleepInit();
	RTC_InitTime(2022,3,14,0,0,0);

	if(Sleep_Time==Period_0_125_S)
	{
		Print_I3("Period_0_125_S\r\n");
		RTC_TMRFunCfg(Period_0_125_S);
	}
	else  if(Sleep_Time==Period_0_25_S)
	{
		Print_I3("Period_0_25_S\r\n");
		RTC_TMRFunCfg(Period_0_25_S);  //  Period_8_S    Period_16_S
	}      
	else  if(Sleep_Time==Period_0_5_S)
	{
		Print_I3("Period_0_5_S\r\n");
		RTC_TMRFunCfg(Period_0_5_S);  //  Period_8_S    Period_16_S
	}            
	else  if(Sleep_Time==Period_1_S)
	{
		Print_I3("Period_1_S\r\n");
		RTC_TMRFunCfg(Period_1_S);  //  Period_8_S    Period_16_S         
	}
	else  if(Sleep_Time==Period_4_S)
	{
		Print_I3("Period_4_S\r\n");
		RTC_TMRFunCfg(Period_4_S);  //  Period_8_S    Period_16_S         
	}
	else  if(Sleep_Time==Period_8_S)
	{
		Print_I3("Period_8_S\r\n");
		RTC_TMRFunCfg(Period_8_S);  //  Period_8_S    Period_16_S         
	}
	else  if(Sleep_Time==Period_16_S)
	{
		Print_I3("Period_16_S\r\n");
		RTC_TMRFunCfg(Period_16_S);  //  Period_8_S    Period_16_S         
	}
	else  if(Sleep_Time==199)
	{
		Print_I3(".0xFFFFF..RTC_TRIGFunCfg \r\n");
		RTC_TRIGFunCfg(0xFFFFF);  // 0x4FFFF = 10s  0xFFFFF=30s
	}
	else  if(Sleep_Time==210)
	{
		//RTC_TMRFunCfg(Period_2_S);
		//RTC_TRIGFunCfg(32768*2);    //32768Ϊ1s

		Print_I3(".0x4FFFF..RTC_TRIGFunCfg \r\n");
		RTC_TRIGFunCfg(0x4FFFF);  // 0x4FFFF = 10s  0xFFFFF=30s
	}      
	else
	{
		Print_I3("Period_16_S \r\n");
		RTC_TMRFunCfg(Period_16_S);  //  Period_8_S    Period_16_S        
	}

	return Is_OK;
}

// PB-8  16 17
//void GPIO_makeup(void)
//{
//    /* ���û���ԴΪ GPIO - PA5 */
//   
//   PWR_PeriphWakeUpCfg(ENABLE, RB_SLP_GPIO_WAKE, Long_Delay);
//}
UINT8  CPU_had_IDLE_counter=0;
UINT8  CPU_had_IDLE=Is_No;
#define EPD_BUSY_IDLE_STABLE_COUNT    2
static UINT8 CPU_busy_had_active=Is_No;
static UINT8 CPU_busy_idle_stable=0;
void   Low_power_IDLE(void)
{
    UINT8 refresh_over;
    UINT8 timeout_over;
    UINT8 busy_supported;
    UINT8 busy_timeout;
    EPD_BUSY_STATUS busy_status;

    if(CPU_had_IDLE_counter == 0)
    {
        CPU_busy_had_active = Is_No;
        CPU_busy_idle_stable = 0;
        EPD_Busy_PrepareObserve();
    }

    EPD_Busy_GetStatus(&busy_status);
    busy_supported = ((busy_status.supported == Is_Yes) &&
                      (busy_status.target_sides != EPD_BUSY_SIDE_NONE)) ? Is_Yes : Is_No;

    if(CPU_had_IDLE==Is_No)
    {
        timeout_over = (CPU_had_IDLE_counter > getRefreshScreenTime()) ? Is_Yes : Is_No;
        busy_timeout = Is_No;
        refresh_over = Is_No;

        if(busy_supported == Is_Yes)
        {
            if(busy_status.any_busy == Is_Yes)
            {
                CPU_busy_had_active = Is_Yes;
                CPU_busy_idle_stable = 0;
            }
            else if((CPU_busy_had_active == Is_Yes) && (busy_status.all_idle == Is_Yes))
            {
                CPU_busy_idle_stable++;
                if(CPU_busy_idle_stable >= EPD_BUSY_IDLE_STABLE_COUNT)
                {
                    refresh_over = Is_Yes;
                }
            }

            if((refresh_over == Is_No) && (timeout_over == Is_Yes))
            {
                busy_timeout = Is_Yes;
                refresh_over = Is_Yes;
            }
        }
        else
        {
            refresh_over = timeout_over;
        }

        if(refresh_over == Is_Yes)
        {
            if(busy_supported == Is_Yes)
            {
                Print_I3("CPU_had_IDLE over=%d target=%x rawA=%d rawB=%d busyA=%d busyB=%d stable=%d timeout=%d",
                         CPU_had_IDLE_counter, busy_status.target_sides, busy_status.raw_a, busy_status.raw_b,
                         busy_status.busy_a, busy_status.busy_b, CPU_busy_idle_stable, busy_timeout);
            }
            else
            {
                Print_I3("CPU_had_IDLE over =%d",CPU_had_IDLE_counter);
            }
#ifdef ENABLE_SOFTWARE_TO_TDX
            TdxInfo_ClearDisplayBusyProtect();
#endif
            CPU_had_IDLE=Is_Yes;
        }
        else
        {
            if(busy_supported == Is_Yes)
            {
                Print_I3("CPU_had_IDLE continue=%d target=%x rawA=%d rawB=%d busyA=%d busyB=%d seen=%d stable=%d",
                         CPU_had_IDLE_counter, busy_status.target_sides, busy_status.raw_a, busy_status.raw_b,
                         busy_status.busy_a, busy_status.busy_b, CPU_busy_had_active, CPU_busy_idle_stable);
            }
            else
            {
                Print_I3("CPU_had_IDLE continue=%d",CPU_had_IDLE_counter);
            }
            CPU_had_IDLE_counter++;
        }
        tmos_start_task(main_task_ID,EVENT_IDLE,1600);
    }
    else
    {
        global_DEVICE_STATUS.fWorked =Is_No;
        global_DEVICE_STATUS.fWillReboot =Is_Yes;
        Print_I3("EVENT_Low_Power=%d",CPU_had_IDLE_counter);
        CPU_had_IDLE_counter = 0;
        CPU_had_IDLE = Is_No;
        CPU_busy_had_active = Is_No;
        CPU_busy_idle_stable = 0;
        tmos_start_task(main_task_ID,EVENT_Low_Power ,500);
    }
}
void  Low_Power_IDLE_Times(UINT8 u8t)
{    
    Low_Power_RTC(u8t);
    //global_DEVICE_STATUS.fWorked = Is_No;       
    //LowPower_Sleep(RB_PWR_RAM30K | RB_PWR_RAM2K); // ERR ֻ����30+2K SRAM ����
    //LowPower_Sleep(0);  // ERR
    //LowPower_Halt();   // ERR
    LowPower_Idle();  // OK
    
    Print_I3("over");
}

void   Low_power(void)
{
	uint32_t tmp, irq_status;
	//Print_I3("-----");   

	if(global_DEVICE_STATUS.fWorked == Is_Yes)
	{
		//Stop_advertising();
		Print_I3("LowPower_IDLE");
		Low_power_IDLE();
		return;
	}
#if 1
	if(global_DEVICE_STATUS.fWorked == Is_Yes)
	{
		// û�� ʹ��
		Print_I3("��Ե�ǰʱ��Ĵ������ʱ�䣬����LSE/LSIʱ��������");
		global_DEVICE_STATUS.fWorked = Is_No;
		global_DEVICE_STATUS.fWillReboot =Is_Yes;
		Low_Power_IDLE_Times(8);
		Low_Power_IDLE_Times(8);
		Low_Power_IDLE_Times(8);
	}
	else
	{
		low_power_IIO_New();
		Print_I3("LowPower_Shutdown Period_4_S");       
		Low_Power_RTC(Period_0_125_S);
	}

	LowPower_Shutdown(0); //ȫ���ϵ磬���Ѻ�λ
	SYS_ResetExecute();
	/*
	��ģʽ���Ѻ��ִ�и�λ������������벻�����У�
	ע��Ҫȷ��ϵͳ˯��ȥ�ٻ��Ѳ��ǻ��Ѹ�λ�������п��ܱ��IDLE�ȼ�����
	*/
#endif
}

//������������������������������������������������������������������������������������������������������������������ 
unsigned char CharToHex(unsigned char bHex)
{
	if((bHex >= 0x0) && (bHex <= 9))
	{
		bHex += 0x30;
	}
	else if((bHex>=10)&&(bHex<=15))//Capital
	{
		bHex += 0x37;
	}  
	else
	{ 
		bHex = 0xff;
	}
	//   Print_I("=%x %c \r\n",bHex,bHex);
	return bHex;
}

void Mac_To_Ascii(void)
{
    uint8_t i,k;

    k=0;
    for(i=0;i<6;i++)
    {
        Mac_ASCII[k++]=CharToHex((Mac[i] & 0xF0)>>4);
        Mac_ASCII[k++]=CharToHex(Mac[i] & 0x0F);
    }

    /*for(i=0;i<12;i++)
    {
        Print_I3("%d=%c ",i,Mac_ASCII[i]);
    }
    Print_I3("\r\n");*/
}

void Init_FirstBootLastRefresh(void)
{
	// 开机时检查“首次开机初始化标志�?	// 约定：FIRST_BOOT_FLAG_VALUE(默认0x66) 为已初始化标志值，其他�?�?xFF)视为首次开�?	// 开机初始化自动定时刷屏功能

