tdxguiping/ESP32_S3_epaper/BLE/BackupUpgrade_OTA/APP/peripheral_main.c
	uint8_t first_boot_flag = getFirstBootFlag();
	if(first_boot_flag != FIRST_BOOT_FLAG_VALUE){
		// 第一次开机：写入特征�?FIRST_BOOT_FLAG_VALUE
		setFirstBootFlag(FIRST_BOOT_FLAG_VALUE);
		saveLastRefreshInfo(LAST_REFRESH_TYPE_COMMON, 0, 0, SCREEN_MODE_AB_SAME, 1, REFRESH_TIMER_ENABLED, SCREEN_ALREADY_CLEARED);
		//Print_I3("Boot: first boot detected, set FIRST_BOOT_FLAG to 0x%02X (old=0x%02X)", FIRST_BOOT_FLAG_VALUE, first_boot_flag);
	}else{
		//Print_I3("Boot: not first boot, FIRST_BOOT_FLAG=0x%02X", first_boot_flag);
	}
}
void Start_LastRefresh(void)
{
	// 开机时只读取定时刷屏开关状态和清屏标志（不修改全局变量，避免影响预存刷屏功能）
	uint8_t saved_enabled, saved_screen_cleared;
	getRefreshTimerStatus(&saved_enabled, &saved_screen_cleared);
	
    // Restore the persisted screen-cleared flag.
    global_screen_cleared_flag = saved_screen_cleared;
	
	if(saved_enabled == REFRESH_TIMER_ENABLED){
		if(saved_screen_cleared == SCREEN_ALREADY_CLEARED){
            // Screen already cleared, skip refresh timer.
		} else {
			// 未清屏状态，启动定时器（使用固定小时数）
			// 将小时转换为系统tick单位�?25us�?			// 1小时 = 3600�?= 3600000毫秒 = 3600000000微秒
			// 系统tick单位�?25us，所以：1小时 = 3600000000 / 625 = 5760000 tick
			StartRefreshTimerCycle();
            // Refresh timer restored from flash.
		}
	}
	else{
        // Refresh timer disabled or not configured.
	}

}


int main(void)
{
 	int length;
	UINT8  GetResetState=0;

#if(defined(DCDC_ENABLE)) && (DCDC_ENABLE == TRUE)
	PWR_DCDCCfg(ENABLE);
#endif
	SetSysClock(SYSCLK_FREQ);   
#ifdef  Debug_mode_on

	GPIOPinRemap(0,RB_PIN_UART0);  // DISABLE  ENABLE
	GPIOB_SetBits(GPIO_Pin_7);
	GPIOB_ModeCfg(GPIO_Pin_7, GPIO_ModeOut_PP_5mA);
	UART0_DefInit(); 

	GetResetState = GetLastResetSta();
	if(GetResetState  != 5)
	{
		//Print_I3("low ");
		// Low_power();
	}
#endif

#ifdef  Low_power_mode_on
#if(defined(HAL_SLEEP)) && (HAL_SLEEP == TRUE)
	low_power_IIO_New();
#endif
#else
	Init_GPIO(); 
	init_cs();
	Set_Spi0_Input_all_input();
#endif    
	CH58x_BLEInit();
	HAL_Init();
	Mac_To_Ascii();

#ifdef ENABLE_BOARD_ENCRYPT
	if(is_illegal_device(Mac, 6) == Is_No){
		//Main_Circulation();
		//return -1;
		Print_I3("check key failure 11\n");
	}
#endif

	GAPRole_PeripheralInit();
	if(GetResetState  == 3)
	{
		Print_I3("reset low pic ");
		setWorkMode(DEVICE_MODE_LOW);
		setFirstBootFlag(0xFF);//恢复默认值，如果不是0x66，就会初始化定时刷屏功能
		initPicSave(SCREEN_CLEAN_ALL,0xff,0xff);
		clearUserId();
	}
	global_DEVICE_STATUS.fFlashType = FLASH_TYPE_EXTERNAL;
    // Init automatic timed refresh state.
    Init_FirstBootLastRefresh();

	/*FlashType g_flashType = detectFlashType();
	if (g_flashType == FLASH_TYPE_EXTERNAL) {
		global_DEVICE_STATUS.fFlashType = FLASH_TYPE_EXTERNAL;
    } else {
		global_DEVICE_STATUS.fFlashType = FLASH_TYPE_INTERNAL;
    }*/

	Peripheral_Init();    
	GAPRole_CentralInit();
	Central_Init();
	main_task_ID = TMOS_ProcessEventRegister(Main_Event);
	global_DEVICE_STATUS.fisOtaed = 0;
	global_DEVICE_STATUS.fWillReboot = Is_No;

	ControlEPDPower(Is_Off);
	AdcInit();
	
#ifndef ENABLE_SOFTWARE_TO_XT
	if(GetResetState  == 3)
	{
		//Print_I3("reset low pic 0000");
		global_DEVICE_STATUS.fInitDriver = Is_Yes;
		cleanDisplayColor(SCREEN_COLOR_WHITE, Is_Yes);
		//global_DEVICE_STATUS.fWorked = Is_No;
		tmos_set_event(main_task_ID,EVENT_Low_Power);
	}
#endif

	//tmos_start_task(main_task_ID,EVENT_Test_Msg ,2*1600);    //  2��
    StartChargeMonitor();
	WWDG_ClearFlag();
	WWDG_ResetCfg(DISABLE); // ENABLE

	Ble_Scan=Is_Off;
	Stop_Central_Scan();
	//tmos_start_task(main_task_ID,EVENT_Start_Peripheral_Mode ,2*1600);
	
	unsigned char mode1[2];
	Get_EEPROM_Flag(mode1,WORKMODE_Position,WORKMODE_Len);
	if(mode1[0] == DEVICE_MODE_HIGH){
		tmos_start_task(main_task_ID,EVENT_Start_Central_Mode ,2*1600);
	}

#ifdef EPD_BWSOLID_IMG_CYCLE_TEST_ENABLE
	tmos_start_task(main_task_ID,EVENT_Test_Msg ,500);
#endif
	
#ifdef EPD_DISPLAY_TEST_ENABLE
	//EPD_Driver_Display_WithOut_Flash_Debug();
	EPD_Driver_Display_From_Flash_Debug();
#endif
    // Start automatic refresh timer.
    Start_LastRefresh();

	uint32_t stored_user_id = getUserId();
    PRINT("--- User id = 0x%08X ---\n", stored_user_id);

	// ADC 漏电保持上拉输入
	GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);

//    Print_I3("CMD PICDIS..AB Screen");
//    Xin_Tai(1);
//    AB_only();   
//    global_BOE_DEVICE_STATUS.fIsNeedStandby = 1;
//    tmos_set_event(main_task_ID,EVENT_Low_Power);

	Main_Circulation();
}
// F:\project\AK80X\e_papper\CH583_Ble_E_paper\BLE\BackupUpgrade_OTA\obj\a.bin
// ��һ���������˻�����������жϣ��ڶ����ڵ͹���ǰʹ�ܿ��Ź����������ڵ͹��ĺ��һ������λ
